app/Controllers/RequestPenelitian.php

    public function verifikasiStatus($id)
    {
        $tgl_diterima = $this->request->getPost('tgl_diterima');
        $status = $this->request->getPost('status');

        $this->permohonan->update($id, [
            'status' => $status,
            'tgl_diterima' => date('Y-m-d', strtotime($tgl_diterima)),
        ]);
---
UPDATE `requests` SET `status` = '3', `tgl_diterima` = '2023-07-23', `tgl_diupdate` = '2023-08-21'
WHERE `requests`.`id` IN ('9')