app/Controllers/Request.php

            $new_file_surat = $old_file_surat;
        }

        $this->permohonan->update($id, [
            'type' => $this->request->getPost('type'),
            'user_id' => $this->request->getPost('user_id'),
            'nama_peserta' => serialize($this->request->getPost('nama_peserta')),
            'nama_instansi' => $this->request->getPost('nama_instansi'),
            'no_surat' => $this->request->getPost('no_surat'),
            'nama_surat' => $this->request->getPost('nama_surat'),
            'asal_surat' => $this->request->getPost('asal_surat'),
            'file_surat' => $new_file_surat,
        ]);
---
UPDATE `requests` SET `type` = 'PKL', `user_id` = '2', `nama_peserta` = '', `nama_instansi` = 'politeknik negeri lampung', `no_surat` = '29/S93/9000', `nama_surat` = 'Permohonan PKL', `asal_surat` = 'politeknik negeri lampung', `file_surat` = 'konsep website.pdf', `tgl_diupdate` = '2023-06-01'
WHERE `requests`.`id` IN ('2')