app/Controllers/User.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data = [
            'title' => 'Data User - PKL Bidang RIDA',
            'data_user' => $this->user->findAll()