app/Models/ModelReplies.php

    public function get_all_kkn()
    {
        $data = $this->select('replies.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi')->table('replies')
            ->join('users', 'users.id = replies.user_id')
            ->where('type', 'KKN')
            ->get()->getResultArray();
---
SELECT `replies`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `replies`
JOIN `users` ON `users`.`id` = `replies`.`user_id`
WHERE `type` = 'KKN'