app/Models/ModelReport.php

SELECT `reports`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `reports`
JOIN `users` ON `users`.`id` = `reports`.`user_id`
WHERE `reports`.`type` = 'PKL'
---
    public function get_all_pkl()
    {
        $data = $this->select('reports.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi')->table('reports')
            ->join('users', 'users.id = reports.user_id')
            // ->join('requests', 'requests.user_id = reports.user_id')
            ->where('reports.type', 'PKL')
            ->get()->getResultArray();

SELECT `reports`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `reports`
JOIN `users` ON `users`.`id` = `reports`.`user_id`
WHERE `reports`.`type` = 'PKL'
AND `users`.`id` = '2'
---
    public function get_detail_pkl($id)
    {
        $data = $this->select('reports.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi, users.email AS email_ketua')->table('reports')
            ->join('users', 'users.id = reports.user_id')
            ->where('type', 'PKL')
            ->where('reports.id', $id)
            ->get()->getRowArray();

SELECT `reports`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `reports`
JOIN `users` ON `users`.`id` = `reports`.`user_id`
WHERE `type` = 'Penelitian'
---
    public function get_all_penelitian()
    {
        $data = $this->select('reports.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi')->table('reports')
            ->join('users', 'users.id = reports.user_id')
            ->where('type', 'Penelitian')
            ->get()->getResultArray();

SELECT `reports`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`, `users`.`email` AS `email_ketua`
FROM `reports`
JOIN `users` ON `users`.`id` = `reports`.`user_id`
WHERE `type` = 'Penelitian'
AND `reports`.`id` = '7'
---
    public function get_detail_penelitian($id)
    {
        $data = $this->select('reports.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi, users.email AS email_ketua')->table('reports')
            ->join('users', 'users.id = reports.user_id')
            ->where('type', 'Penelitian')
            ->where('reports.id', $id)
            ->get()->getRowArray();