app/Models/ModelReplies.php

SELECT `replies`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `replies`
JOIN `users` ON `users`.`id` = `replies`.`user_id`
WHERE `replies`.`type` = 'PKL'
---
    public function get_all_pkl()
    {
        $data = $this->select('replies.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi')->table('replies')
            ->join('users', 'users.id = replies.user_id')
            // ->join('requests', 'requests.user_id = replies.user_id')
            ->where('replies.type', 'PKL')
            ->get()->getResultArray();

SELECT `replies`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `replies`
JOIN `users` ON `users`.`id` = `replies`.`user_id`
WHERE `replies`.`type` = 'PKL'
AND `users`.`id` = '2'
---
    public function get_byUser_pkl()
    {
        $data = $this->select('replies.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi')->table('replies')
            ->join('users', 'users.id = replies.user_id')
            // ->join('requests', 'requests.user_id = replies.user_id')
            ->where('replies.type', 'PKL')
            ->where('users.id', session()->get('id'))
            ->get()->getResultArray();

SELECT `replies`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `replies`
JOIN `users` ON `users`.`id` = `replies`.`user_id`
WHERE `type` = 'PKL'
AND `replies`.`id` = '1'
---
    public function get_detail_pkl($id)
    {
        $data = $this->select('replies.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi')->table('replies')
            ->join('users', 'users.id = replies.user_id')
            ->where('type', 'PKL')
            ->where('replies.id', $id)
            ->get()->getRowArray();

SELECT `replies`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `replies`
JOIN `users` ON `users`.`id` = `replies`.`user_id`
WHERE `type` = 'Penelitian'
---
    public function get_all_kkn()
    {
        $data = $this->select('replies.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi')->table('replies')
            ->join('users', 'users.id = replies.user_id')
            ->where('type', 'KKN')
            ->get()->getResultArray();

SELECT `replies`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `replies`
JOIN `users` ON `users`.`id` = `replies`.`user_id`
WHERE `type` = 'KKN'
AND `replies`.`id` = '5'
---
    public function get_detail_kkn($id)
    {
        $data = $this->select('replies.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi')->table('replies')
            ->join('users', 'users.id = replies.user_id')
            ->where('type', 'KKN')
            ->where('replies.id', $id)
            ->get()->getRowArray();

SELECT `replies`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `replies`
JOIN `users` ON `users`.`id` = `replies`.`user_id`
WHERE `type` = 'Penelitian'
AND `replies`.`id` = '7'
---
    public function get_all_penelitian()
    {
        $data = $this->select('replies.*, users.name AS nama_ketua,users.instansi_name AS nama_instansi')->table('replies')
            ->join('users', 'users.id = replies.user_id')
            ->where('type', 'Penelitian')
            ->get()->getResultArray();