app/Models/ModelSupervisi.php

    public function get_all_supervisi()
    {
        $data = $this->select('supervisis.*, users.name AS nama_ketua, users.instansi_name AS nama_instansi')->table('supervisis')
            ->join('users', 'users.id = supervisis.user_id')
            ->get()->getResultArray();
---
SELECT `supervisis`.*, `users`.`name` AS `nama_ketua`, `users`.`instansi_name` AS `nama_instansi`
FROM `supervisis`
JOIN `users` ON `users`.`id` = `supervisis`.`user_id`

    public function get_detail_supervisi($id)
    {
        $data = $this->select('supervisis.*, users.name AS nama_ketua,users.email AS email_ketua')->table('supervisis')
            ->join('users', 'users.id = supervisis.user_id')
            ->where('supervisis.id', $id)
            ->get()->getRowArray();
---
SELECT `supervisis`.*, `users`.`name` AS `nama_ketua`, `users`.`email` AS `email_ketua`
FROM `supervisis`
JOIN `users` ON `users`.`id` = `supervisis`.`user_id`
WHERE `supervisis`.`id` = '2'