app/Models/ModelRequest.php

    public function get_all_pkl()
    {
        $data = $this->select('requests.*, users.name AS nama_ketua')->table('requests')
            ->join('users', 'users.id = requests.user_id')
            ->where('type', 'PKL')
            ->get()->getResultArray();
---
SELECT `requests`.*, `users`.`name` AS `nama_ketua`
FROM `requests`
JOIN `users` ON `users`.`id` = `requests`.`user_id`
WHERE `type` = 'PKL'

    public function get_byUser_pkl()
    {
        $data = $this->select('requests.*, users.name AS nama_ketua')->table('requests')
            ->join('users', 'users.id = requests.user_id')
            ->where('type', 'PKL')
            ->where('users.id', session()->get('id'))
            ->get()->getResultArray();
---
SELECT `requests`.*, `users`.`name` AS `nama_ketua`
FROM `requests`
JOIN `users` ON `users`.`id` = `requests`.`user_id`
WHERE `type` = 'PKL'
AND `requests`.`id` = '1'

    public function get_all_kkn()
    {
        $data = $this->select('requests.*, users.name AS nama_ketua')->table('requests')
            ->join('users', 'users.id = requests.user_id')
            ->where('type', 'KKN')
            ->get()->getResultArray();
---
SELECT `requests`.*, `users`.`name` AS `nama_ketua`
FROM `requests`
JOIN `users` ON `users`.`id` = `requests`.`user_id`
WHERE `type` = 'KKN'

    public function get_all_penelitian()
    {
        $data = $this->select('requests.*, users.name AS nama_ketua')->table('requests')
            ->join('users', 'users.id = requests.user_id')
            ->where('type', 'Penelitian')
            ->get()->getResultArray();
---
SELECT `requests`.*, `users`.`name` AS `nama_ketua`
FROM `requests`
JOIN `users` ON `users`.`id` = `requests`.`user_id`
WHERE `type` = 'Penelitian'

    public function get_chart_pkl_byInstitusi()
    {
        $data = $this->select('requests.*, COUNT(requests.id) AS jumlah, users.name AS nama_ketua')->table('requests')
            ->join('users', 'users.id = requests.user_id')
            ->where('type', 'PKL')
            ->where('requests.status', '1')
            ->groupBy('requests.nama_instansi')
            ->get()->getResultArray();
---
SELECT `requests`.*, COUNT(requests.id) AS jumlah, `users`.`name` AS `nama_ketua`
FROM `requests`
JOIN `users` ON `users`.`id` = `requests`.`user_id`
WHERE `type` = 'PKL'
AND `requests`.`status` = '3'
GROUP BY `requests`.`nama_instansi`

    public function get_chart_kkn_byInstitusi()
    {
        $data = $this->select('requests.*, COUNT(requests.id) AS jumlah, users.name AS nama_ketua')->table('requests')
            ->join('users', 'users.id = requests.user_id')
            ->where('type', 'KKN')
            ->where('requests.status', '1')
            ->groupBy('requests.nama_instansi')
            ->get()->getResultArray();
---
SELECT `requests`.*, COUNT(requests.id) AS jumlah, `users`.`name` AS `nama_ketua`
FROM `requests`
JOIN `users` ON `users`.`id` = `requests`.`user_id`
WHERE `type` = 'KKN'
AND `requests`.`status` = '3'
GROUP BY `requests`.`nama_instansi`

    public function get_chart_penelitian_byInstitusi()
    {
        $data = $this->select('requests.*, COUNT(requests.id) AS jumlah, users.name AS nama_ketua')->table('requests')
            ->join('users', 'users.id = requests.user_id')
            ->where('type', 'Penelitian')
            ->where('requests.status', '1')
            ->groupBy('requests.nama_instansi')
            ->get()->getResultArray();
---
SELECT `requests`.*, COUNT(requests.id) AS jumlah, `users`.`name` AS `nama_ketua`
FROM `requests`
JOIN `users` ON `users`.`id` = `requests`.`user_id`
WHERE `type` = 'Penelitian'
AND `requests`.`status` = '3'
GROUP BY `requests`.`nama_instansi`

    public function get_chart_pkl_byYear()
    {
        $data = $this->select('requests.*, COUNT(requests.id) AS jumlah, YEAR(requests.tgl_diterima) AS tahun, users.name AS nama_ketua')->table('requests')
            ->join('users', 'users.id = requests.user_id')
            ->where('type', 'PKL')
            ->where('requests.status', '1')
            ->groupBy('YEAR(requests.tgl_diterima)')
            ->get()->getResultArray();
---
SELECT `requests`.*, COUNT(requests.id) AS jumlah, YEAR(requests.tgl_diterima) AS tahun, `users`.`name` AS `nama_ketua`
FROM `requests`
JOIN `users` ON `users`.`id` = `requests`.`user_id`
WHERE `type` = 'PKL'
AND `requests`.`status` = '3'
GROUP BY YEAR(requests.tgl_diterima)

    public function get_chart_kkn_byYear()
    {
        $data = $this->select('requests.*, COUNT(requests.id) AS jumlah, YEAR(requests.tgl_diterima) AS tahun, users.name AS nama_ketua')->table('requests')
            ->join('users', 'users.id = requests.user_id')
            ->where('type', 'KKN')
            ->where('requests.status', '1')
            ->groupBy('YEAR(requests.tgl_diterima)')
            ->get()->getResultArray();
---
SELECT `requests`.*, COUNT(requests.id) AS jumlah, YEAR(requests.tgl_diterima) AS tahun, `users`.`name` AS `nama_ketua`
FROM `requests`
JOIN `users` ON `users`.`id` = `requests`.`user_id`
WHERE `type` = 'KKN'
AND `requests`.`status` = '3'
GROUP BY YEAR(requests.tgl_diterima)

    public function get_chart_penelitian_byYear()
    {
        $data = $this->select('requests.*, COUNT(requests.id) AS jumlah, YEAR(requests.tgl_diterima) AS tahun, users.name AS nama_ketua')->table('requests')
            ->join('users', 'users.id = requests.user_id')
            ->where('type', 'Penelitian')
            ->where('requests.status', '1')
            ->groupBy('YEAR(requests.tgl_diterima)')
            ->get()->getResultArray();
---
SELECT `requests`.*, COUNT(requests.id) AS jumlah, YEAR(requests.tgl_diterima) AS tahun, `users`.`name` AS `nama_ketua`
FROM `requests`
JOIN `users` ON `users`.`id` = `requests`.`user_id`
WHERE `type` = 'Penelitian'
AND `requests`.`status` = '3'
GROUP BY YEAR(requests.tgl_diterima)