app/Models/ModelAuth.php

    public function get_active_user()
    {
        $data = $this->db->table('users')
            ->where('status', '1')
            ->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `status` = '1'

    public function get_user_admin()
    {
        $data = $this->table('users')
            ->where('id', 1)
            ->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = 1

    public function get_user_byLogin()
    {
        $data = $this->table('users')
            ->where('id', session()->get('id'))
            ->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '4'